{-#LANGUAGE OverloadedStrings#-}
module Data.P440.XML.Instances.PNO where

import qualified Data.P440.Domain.PNO as PNO
import Data.P440.Domain.SimpleTypes
import Data.P440.Domain.ComplexTypes

import Data.P440.XML.XML
import qualified Data.P440.XML.Instances.ComplexTypes as C

instance ToNode PNO.Файл where
    toNode (PNO.Файл идЭС версПрог телОтпр
                     должнОтпр фамОтпр поручНО) =
        complex "Файл"
                ["ИдЭС"      =: идЭС
                ,"ВерсПрог"  =: версПрог
                ,"ТелОтпр"   =: телОтпр
                ,"ДолжнОтпр" =: должнОтпр
                ,"ФамОтпр"   =: фамОтпр]
                [Single поручНО]

instance ToNode PNO.ПоручНО where
    toNode (PNO.ПоручНО номПоруч датаПодп видПлат сумПлат статус инннп
                        кппнп плательщ номСчПлИлиКЭСП банкПл бикбПл номСчБПл
                        номФ банкПол бикбПол номСчБПол иннПол
                        кппПол получ номСчПол видОп назПлКод
                        очерПл кодПл резПоле назнПл кгн
                        укгн кбк октмо кодОсн срокУплТр
                        номТреб датаТреб типПлат порВал) =
        complex "ПоручНО"
                ["НомПоруч"  =: номПоруч
                ,"ДатаПодп"  =: датаПодп
                ,"ВидПлат"   =: видПлат
                ,"СумПлат"   =: сумПлат
                ,"Статус"    =: статус
                ,"ИНННП"     =: инннп
                ,"КППНП"     =: кппнп
                ,"Плательщ"  =: плательщ
                ,"БанкПл"    =: банкПл
                ,"НомСчБПл"  =: номСчБПл
                ,"НомФ"      =: номФ
                ,"БанкПол"   =: банкПол
                ,"БИКБПол"   =: бикбПол
                ,"НомСчБПол" =: номСчБПол
                ,"ИННПол"    =: иннПол
                ,"КПППол"    =: кппПол
                ,"Получ"     =: получ
                ,"НомСчПол"  =: номСчПол
                ,"ВидОп"     =: видОп
                ,"НазПлКод"  =: назПлКод
                ,"ОчерПл"    =: очерПл
                ,"КодПл"     =: кодПл
                ,"РезПоле"   =: резПоле
                ,"НазнПл"    =: назнПл
                ,"КГН"       =: кгн
                ,"УКГН"      =: укгн
                ,"КБК"       =: кбк
                ,"ОКТМО"     =: октмо
                ,"КодОсн"    =: кодОсн
                ,"СрокУплТр" =: срокУплТр
                ,"НомТреб"   =: номТреб
                ,"ДатаТреб"  =: датаТреб
                ,"ТипПлат"   =: типПлат]
                [Sequence номСчПлИлиКЭСП
                ,Sequence порВал]

instance ToNode PNO.НомСчПлИлиКЭСП where
    toNode (PNO.Счет (НомСч счет)) = simple "Счет" счет
    toNode (PNO.КЭСП кэсп) = simple "КЭСП" кэсп

instance ToNode PNO.ПорВал where
    toNode (PNO.ПорВал номПорВал датаПорВал номВалСч) =
        complex_ "ПорВал"
                 ["НомПорВал"  =: номПорВал
                 ,"ДатаПорВал" =: датаПорВал
                 ,"НомВалСч"   =: номВалСч]
